{
  "posts": [
    {
      "id": 1,
      "title": "Hello World",
      "subtitle": "This is my last post",
      "text": "Hey hello everyone this is my first post, I don't know what to say and how to make more post re-using the Component Post, so that is what I need to learn to do by tomorrow.",
      "date": "12/06/2020 - 10:50 hs"
    },
    {
      "id": 2,
      "title": "it's been a couple days",
      "subtitle": "Still struggling",
      "text": "Well, as I said, it's been a couple days where I couldn't find a way to set the date as I wanted to, so... I'm typping it manually for now, until I discover how to do it, I got a function where I can see the date especifically even when I can just see the clock of my PC but well, that was for the sake of programming some stuff meanwhile. ",
      "date": "14/06/2020 - 10:54 hs"
    },
    {
      "id": 3,
      "title": "Personal",
      "subtitle": "Just to get clear",
      "text": "I will use this blog for posting what I need, even if that is about programming stuff, or personal things like feelings and all that kind of things, beware I need to get distressed sometimes and as a 'public' place to it, I will use it for that, I know I am talking to myself right now but well, someday I will be very happy to set all this into an online thing, hope to happen as soon as possible",
      "date": "14/06/2020 - 11:23 hs"
    },
    {
      "id": 4,
      "title": "Learning-new things",
      "subtitle": "Some changes in here",
      "text": "Just learning a days ago how to make re-usables 'components' with plain JavaScript, something that I wanted to learn since I kinda begin with programming, it's been a lot harder that the one time when I don't know how to link a CSS file, haha! To summarize I change all the blog to a JavaScript plain with HTML and CSS page, I'm not using React anymore for this blog for now, I have a lot to learn yet from JavaScript so do I.",
      "date": "17/6/2020 - 11:16 hs"
    },
    {
      "title": "I'm feeling angry",
      "subtitle": "I don't want to",
      "text": "So I was so happy because I'm learning a lot and I'm so glad that what I'm doing is like a real job I don't want to hate programming, so don't make me hate it too as you do with other things that I like, I don't wanna get mad at you, neither with myself so I'll keep in here, doing some research and talk to you later. I love you but sometimes you make me feel so bad, I'm angry right now, and I was happy a few seconds ago.",
      "date": "11/7/2020  -  19:38",
      "id": 5
    },
    {
      "title": "Pair programming meet",
      "subtitle": "I like the metodology",
      "text": "Just finished of being in one meeting of \"pair\" programming but with a third person, that is helping us a LOT with our little project of a job board, I like a lot how he is kinda teaching us, and is so useful seeing him how he will do all the things that we are doing. I want to keep doing this thing. it's a real fulfilled experience.",
      "date": "11/7/2020  -  19:39",
      "id": 6
    },
    {
      "title": "I'm coding on Linux",
      "subtitle": "Linux or non-Linux?",
      "text": "So I'm in Linux right now coding in here, in another PC most specifically in a laptop, an old laptop that can't support so well Windows so I'm in doubt if is better Linux or windows, for install a Linux system in my main PC,I like the interface on Linux but I don't want to have two SO running in there, but I have no option with the other one where Windows is essential for you know Games and stuff for my girlfriend (she is a youtuber) and use that one PC for editing stuff and so well, I'm using the linux laptop now because of that, she is with the other doing some research for a new video.\nSo should I install Linux along with Windows in my main PC ? In that case I'm pretty sure that I'll install Deepin distro, I've been looking for distros that are aesthetic and I really like that one.\n",
      "date": "13/7/2020  -  15:42",
      "id": 7
    }
  ]
}