[
    {
      "title": "Hello World",
      "subtitle": "This is my last post",
      "text": "Hey hello everyone this is my first post, I don't know what to say and how to make more post re-using the Component Post, so that is what I need to learn to do by tomorrow.",
      "date": "12/06/2020 - 10:50 hs"
    },
    {
      "title": "it's been a couple days",
      "subtitle": "Still struggling",
      "text": "Well, as I said, it's been a couple days where I couldn't find a way to set the date as I wanted to, so... I'm typping it manually for now, until I discover how to do it, I got a function where I can see the date especifically even when I can just see the clock of my PC but well, that was for the sake of programming some stuff meanwhile. ",
      "date": "14/06/2020 - 10:54 hs"
    },
    {
      "title": "Personal",
      "subtitle": "Just to get clear",
      "text": "I will use this blog for posting what I need, even if that is about programming stuff, or personal things like feelings and all that kind of things, beware I need to get distressed sometimes and as a 'public' place to it, I will use it for that, I know I am talking to myself right now but well, someday I will be very happy to set all this into an online thing, hope to happen as soon as possible",
      "date": "14/06/2020 - 11:23 hs"
    },
    {
      "title": "Learning-new things",
      "subtitle": "Some changes in here",
      "text": "Just learning a days ago how to make re-usables 'components' with plain JavaScript, something that I wanted to learn since I kinda begin with programming, it's been a lot harder that the one time when I don't know how to link a CSS file, haha! To summarize I change all the blog to a JavaScript plain with HTML and CSS page, I'm not using React anymore for this blog for now, I have a lot to learn yet from JavaScript so do I.",
      "date": "17/6/2020 - 11:16 hs"
    },
    {
      "title": "Pair programming meet",
      "subtitle": "I like the metodology",
      "text": "Just finished of being in one meeting of \"pair\" programming but with a third person, that is helping us a LOT with our little project of a job board, I like a lot how he is kinda teaching us, and is so useful seeing him how he will do all the things that we are doing. I want to keep doing this thing. it's a real fulfilled experience.",
      "date": "11/7/2020  -  19:39"
    },
    {
      "title": "I'm coding on Linux",
      "subtitle": "Linux or non-Linux?",
      "text": "So I'm in Linux right now coding in here, in another PC most specifically in a laptop, an old laptop that can't support so well Windows so I'm in doubt if is better Linux or windows, for install a Linux system in my main PC,I like the interface on Linux but I don't want to have two SO running in there, but I have no option with the other one where Windows is essential for you know Games and stuff for my girlfriend (she is a youtuber) and use that one PC for editing stuff and so well, I'm using the linux laptop now because of that, she is with the other doing some research for a new video.\nSo should I install Linux along with Windows in my main PC ? In that case I'm pretty sure that I'll install Deepin distro, I've been looking for distros that are aesthetic and I really like that one.\n",
      "date": "13/7/2020  -  15:42"
    },
    {
      "title": "Thinking",
      "subtitle": "Should I keep doing changes?",
      "text": "Okay so, I don't know if I should keep doing some changes in this blog page because it looks pretty good right now, with a button and is has the look that I always wanted, so the thing is, should I make more changes to this page? Maybe do a Home page before entering the blog per sé.\nI want to make this a real blog for my personal use, so what I should do is to make some research in how to keep the database of all this posts that I'm writing in here (if that can be free, better.)",
      "date": "14/7/2020  -  21:02"
    },
    {
      "title": "Updating the blog",
      "subtitle": "A lot of little changes",
      "text": "In response to the post under this one, yep I'm still making some changes to the blog, and I guess I'll keep doing it until I really like how it looks like. Furthermore I'll need to think in the logical part to add some functionalities to the blog, with a Home Page and a limit of post to show there, maybe a filter, that by the way I was dealing with a really toft one the last week or so, so I think I should do it as soon as possible.",
      "date": "15/7/2020  -  0:37"
    }
  ]
